section Section1;

shared A_รายงานการขายรถจักรยานยนต์_EX = let
    แหล่งที่มา = Excel.Workbook(File.Contents("C:\Users\manat\OneDrive\ระบบงาน\ข้อมูล-ส้ม\รายงานการชำระเงิน.2.3.xlsx"), null, true),
    A_รายงานการขายรถจักรยานยนต์_EX_Table = แหล่งที่มา{[Item="A_รายงานการขายรถจักรยานยนต์_EX",Kind="Table"]}[Data],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(A_รายงานการขายรถจักรยานยนต์_EX_Table,{{"Source.Name", type text}, {"เลขที่ใบขาย", type text}, {"วันที่ขาย", type date}, {"BRANCH_NAME", type text}, {"ประเภทใบขาย", type text}, {"สถานะใบขาย", type text}, {"เลขที่บัตรประชาชน", type text}, {"ชื่อลูกค้า", type text}, {"โทรศัพท์", type text}, {"ที่อยู่", type text}, {"ประเภทลูกค้า", type text}, {"บริษัทไฟแนนซ์", type text}, {"ประเภทรถ", type text}, {"ยี่ห้อ", type text}, {"รุ่นรถ", type text}, {"แบบรถ", type text}, {"สี", type text}, {"หมายเลขเครื่อง", type text}, {"หมายเลขตัวถัง", type text}, {"เลขทะเบียน", type text}, {"ต้นทุนต่อหน่วย", type number}, {"ภาษีของต้นทุนต่อหน่วย", type number}, {"ราคาขาย", Int64.Type}, {"ส่วนลดรวม", Int64.Type}, {"ราคาขายรวมหลังหักส่วนลด", Int64.Type}, {"ประเภทการขาย", type text}, {"เลขที่ใบเบิก", type text}, {"วันที่เบิก", type date}, {"สถานะใบเบิก", type text}, {"พนักงานขาย", type text}, {"จำนวนเงินคงค้าง", Int64.Type}}),
    ทำซ้ำคอลัมน์แล้ว = Table.DuplicateColumn(เปลี่ยนแปลงชนิดแล้ว, "เลขที่ใบขาย", "เลขที่ใบขาย - คัดลอก"),
    แบ่งคอลัมน์ตามตัวคั่น = Table.SplitColumn(ทำซ้ำคอลัมน์แล้ว, "เลขที่ใบขาย - คัดลอก", Splitter.SplitTextByDelimiter("-", QuoteStyle.Csv), {"เลขที่ใบขาย - คัดลอก.1", "เลขที่ใบขาย - คัดลอก.2"}),
    เปลี่ยนแปลงชนิดแล้ว1 = Table.TransformColumnTypes(แบ่งคอลัมน์ตามตัวคั่น,{{"เลขที่ใบขาย - คัดลอก.1", type text}, {"เลขที่ใบขาย - คัดลอก.2", type text}}),
    เปลี่ยนชื่อคอลัมน์แล้ว = Table.RenameColumns(เปลี่ยนแปลงชนิดแล้ว1,{{"เลขที่ใบขาย - คัดลอก.1", "สาขา"}}),
    เอาคอลัมน์ออกแล้ว = Table.RemoveColumns(เปลี่ยนชื่อคอลัมน์แล้ว,{"เลขที่ใบขาย - คัดลอก.2"}),
    เรียงลำดับแถวแล้ว = Table.Sort(เอาคอลัมน์ออกแล้ว,{{"เลขที่ใบขาย", Order.Ascending}}),
    กรองแถวแล้ว = Table.SelectRows(เรียงลำดับแถวแล้ว, each ([ประเภทใบขาย] <> "ขายส่ง") and ([สถานะใบขาย] <> "ยกเลิก") and ([ประเภทรถ] = "รถใหม่"))
in
    กรองแถวแล้ว;

shared คำนวณเวลาทำงาน = let
    แหล่งที่มา = Excel.Workbook(File.Contents("C:\Users\manat\OneDrive\ระบบเงินเดือน\รายงานาเงินเดือนV2.xlsx"), null, true),
    #"คำนวณเวลาทำงาน (3)_Sheet" = แหล่งที่มา{[Item="คำนวณเวลาทำงาน (3)",Kind="Sheet"]}[Data],
    ส่วนหัวที่เลื่อนระดับ = Table.PromoteHeaders(#"คำนวณเวลาทำงาน (3)_Sheet", [PromoteAllScalars=true]),
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(ส่วนหัวที่เลื่อนระดับ,{{"วันที่ลงเวลา", type date}, {"Employee Name", type text}, {"ประจำเดือน", type date}, {"เดือน-ข้อมูลพนักงาน", type date}, {"Team Name", type text}, {"Position Name", type text}, {"Day", type text}, {"Clock In", type text}, {"In Type", type text}, {"In Name", type text}, {"Clock Out", type text}, {"Out Type", type text}, {"Out Name", type text}, {"Sum", type text}, {"Actual Time", type text}, {"Work Hour", type text}, {"Clock Late", type text}, {"Leave Early", type text}, {"Over Time", type text}, {"ประเภทวันลา", type text}, {"เวลาที่ขอลา", type text}, {"Leave Time", type text}, {"Absence", type text}, {"Break Duration", type text}, {"ข้อมูลพนักงาน (2).Team name", type text}, {"รหัสร้าน", type text}, {"ตำแหน่ง", type text}, {"สังกัด", type text}, {"วันนหยุด", type text}, {"ข้อมูลพนักงาน (2).วันหยุดกลางเดือน", type text}, {"ข้อมูลพนักงาน (2).ค่าซักเสื้อ", Int64.Type}, {"ข้อมูลพนักงาน (2).ค่าข้าว", type any}, {"ข้อมูลพนักงาน (2).ค่าเบี้ยขยัน", Int64.Type}, {"ข้อมูลพนักงาน (2).ประกันสังคม", type number}, {"ข้อมูลพนักงาน (2).กองทุนสำรองฯ", type number}, {"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ", type text}, {"ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ", type text}, {"ข้อมูลพนักงาน (2).สถานะการทำงาน", type any}, {"ข้อมูลพนักงาน (2).เลขที่บัญชี", type text}, {"ข้อมูลพนักงาน (2).คอลัมน์3", type text}, {"ข้อมูลพนักงาน (2). เงินเดือน/ครั้ง ", type number}, {"ข้อมูลพนักงาน (2).เงินเพิ่มพิเศษ", Int64.Type}, {"ข้อมูลพนักงาน (2).OT-วันทำงาน", type number}, {"ข้อมูลพนักงาน (2).ก.ย.ศ", Int64.Type}, {"วันหยุดกลางเดือน", type text}, {"วันหยุดประจำปี.KEY", type text}, {"วันหยุดชดเชย-กลางเดือน.ชดเชยวันหยุดประจำปี", type text}, {"สลับวันหยุด.ประเภทวันหยุด", type any}, {"วันหยุดประจำสัปดาห์1", type text}, {"วันหยุดกลางเดือน1", type text}, {"ไม่สแเกนเวลาเข้างาน", type any}, {"สรุปประเภทวันหยุด", type text}, {"สรุปวันทำงาน", type text}, {"ค่าข้าว", type any}, {"ค่าซักเสื้อ", Int64.Type}, {"ค่าเบี้ยขยัน", Int64.Type}, {"เวลาการมาทำงาน", type text}}),
    กรองแถวแล้ว = Table.SelectRows(เปลี่ยนแปลงชนิดแล้ว, each ([#"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ"] = "ค่าคอมปกติ")),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว = Table.AddColumn(กรองแถวแล้ว, "กำหนดเอง", each let
        สังกัด = [สังกัด],
        ประเภทวันหยุด = [สรุปประเภทวันหยุด],
        สถานะวันทำงาน = [สรุปวันทำงาน],
        วันหยุดไม่มีค่าคอม = {"ลากิจ", "ลาป่วย", "ลาพักร้อน", "ขาดงาน", "ชดเชย"}
    in
        if สังกัด = "สิงห์ชัย" then
            if ประเภทวันหยุด = "วันหยุดประจำปี" and สถานะวันทำงาน = "วันทำงาน" then
                "คำนวณค่าคอม"
            else if ประเภทวันหยุด = "วันหยุดประจำปี" then
                null
            else if ประเภทวันหยุด = "วันหยุดประจำสัปดาห์" then
                "คำนวณค่าคอม"
            else if สถานะวันทำงาน = "วันทำงาน" and not List.Contains(วันหยุดไม่มีค่าคอม, ประเภทวันหยุด) then
                "คำนวณค่าคอม"
            else
                null
        else
            if สถานะวันทำงาน = "วันทำงาน" then
                "คำนวณค่าคอม"
            else
                null),
    ผสานข้อคำถาม = Table.NestedJoin(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว, {"Employee Name"}, ข้อมูลพนักงานขาย, {"Employee Name"}, "ข้อมูลพนักงานขาย", JoinKind.LeftOuter),
    #"ขยาย ข้อมูลพนักงานขาย" = Table.ExpandTableColumn(ผสานข้อคำถาม, "ข้อมูลพนักงานขาย", {"รหัสสาขา", "สาขา"}, {"ข้อมูลพนักงานขาย.รหัสสาขา", "ข้อมูลพนักงานขาย.สาขา"})
in
    #"ขยาย ข้อมูลพนักงานขาย";

shared ข้อมูลพนักงานขาย = let
    แหล่งที่มา = Excel.CurrentWorkbook(){[Name="Table4"]}[Content],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(แหล่งที่มา,{{"Employee Name", type text}, {"รหัสสาขา", type text}, {"สาขา", type text}})
in
    เปลี่ยนแปลงชนิดแล้ว;

shared คำนวณค่าคอม = let
    แหล่งที่มา = Excel.Workbook(File.Contents("C:\Users\manat\OneDrive\ระบบเงินเดือน\รายงานาเงินเดือนV2.xlsx"), null, true),
    คำนวณเวลาทำงาน__2_Table = แหล่งที่มา{[Item="คำนวณเวลาทำงาน__2",Kind="Table"]}[Data],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(คำนวณเวลาทำงาน__2_Table,{{"วันที่ลงเวลา", type date}, {"Employee Name", type text}, {"ประจำเดือน", type date}, {"เดือน-ข้อมูลพนักงาน", type date}, {"Team Name", type text}, {"Position Name", type text}, {"Day", type text}, {"Clock In", type text}, {"In Type", type text}, {"In Name", type text}, {"Clock Out", type text}, {"Out Type", type text}, {"Out Name", type text}, {"Sum", type text}, {"Actual Time", type text}, {"Work Hour", type text}, {"Clock Late", type text}, {"Leave Early", type text}, {"Over Time", type text}, {"ประเภทวันลา", type text}, {"เวลาที่ขอลา", type text}, {"Leave Time", type text}, {"Absence", type text}, {"Break Duration", type text}, {"ข้อมูลพนักงาน (2).Team name", type text}, {"รหัสร้าน", type text}, {"ตำแหน่ง", type text}, {"สังกัด", type text}, {"วันนหยุด", type text}, {"ข้อมูลพนักงาน (2).วันหยุดกลางเดือน", type text}, {"ข้อมูลพนักงาน (2).ค่าซักเสื้อ", Int64.Type}, {"ข้อมูลพนักงาน (2).ค่าข้าว", type any}, {"ข้อมูลพนักงาน (2).ค่าเบี้ยขยัน", Int64.Type}, {"ข้อมูลพนักงาน (2).ประกันสังคม", type number}, {"ข้อมูลพนักงาน (2).กองทุนสำรองฯ", type number}, {"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ", type text}, {"ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ", type text}, {"ข้อมูลพนักงาน (2).สถานะการทำงาน", type any}, {"ข้อมูลพนักงาน (2).เลขที่บัญชี", type text}, {"ข้อมูลพนักงาน (2).คอลัมน์3", type text}, {"ข้อมูลพนักงาน (2). เงินเดือน/ครั้ง ", type number}, {"ข้อมูลพนักงาน (2).เงินเพิ่มพิเศษ", Int64.Type}, {"ข้อมูลพนักงาน (2).OT-วันทำงาน", type number}, {"ข้อมูลพนักงาน (2).ก.ย.ศ", Int64.Type}, {"วันหยุดกลางเดือน", type text}, {"วันหยุดประจำปี.KEY", type text}, {"วันหยุดชดเชย-กลางเดือน.ชดเชยวันหยุดประจำปี", type text}, {"สลับวันหยุด.ประเภทวันหยุด", type any}, {"วันหยุดประจำสัปดาห์1", type text}, {"วันหยุดกลางเดือน1", type text}, {"ไม่สแเกนเวลาเข้างาน", type any}, {"สรุปประเภทวันหยุด", type text}, {"สรุปวันทำงาน", type text}, {"ค่าข้าว", type any}, {"ค่าซักเสื้อ", Int64.Type}, {"ค่าเบี้ยขยัน", Int64.Type}, {"เวลาการมาทำงาน", type text}}),
    กรองแถวแล้ว = Table.SelectRows(เปลี่ยนแปลงชนิดแล้ว, each ([#"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ"] = "ค่าคอมปกติ")),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว = Table.AddColumn(กรองแถวแล้ว, "กำหนดเอง", each let
    สังกัด = [สังกัด],
    ประเภทวันหยุด = [สรุปประเภทวันหยุด],
    สถานะวันทำงาน = [สรุปวันทำงาน],
    วันหยุดไม่มีค่าคอม = {"ลากิจ", "ลาป่วย", "ลาพักร้อน", "ขาดงาน","ลาคลอดบุตร"}
in
    if สังกัด = "สิงห์ชัย" or สังกัด = "ป.เปา" then
        if ประเภทวันหยุด = "วันหยุดประจำปี" and สถานะวันทำงาน = "วันทำงาน" then
            "คำนวณค่าคอม"
        else if ประเภทวันหยุด = "วันหยุดประจำปี" then
            null
        else if ประเภทวันหยุด = "วันหยุดประจำสัปดาห์" then
            "คำนวณค่าคอม"
        else if ประเภทวันหยุด = "ชดเชย" and สถานะวันทำงาน = "วันหยุด" then
            "คำนวณค่าคอม"
        else if สถานะวันทำงาน = "วันทำงาน" and not List.Contains(วันหยุดไม่มีค่าคอม, ประเภทวันหยุด) then
            "คำนวณค่าคอม"
        else
            null
    else
        if สถานะวันทำงาน = "วันทำงาน" and not List.Contains(วันหยุดไม่มีค่าคอม & {"ชดเชย"}, ประเภทวันหยุด) then
            "คำนวณค่าคอม"
        else
            null),
    ผสานข้อคำถาม = Table.NestedJoin(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว, {"Employee Name"}, ข้อมูลพนักงานขาย, {"Employee Name"}, "ข้อมูลพนักงานขาย", JoinKind.LeftOuter),
    #"ขยาย ข้อมูลพนักงานขาย" = Table.ExpandTableColumn(ผสานข้อคำถาม, "ข้อมูลพนักงานขาย", {"รหัสสาขา", "สาขา"}, {"ข้อมูลพนักงานขาย.รหัสสาขา", "ข้อมูลพนักงานขาย.สาขา"}),
    กรองแถวแล้ว1 = Table.SelectRows(#"ขยาย ข้อมูลพนักงานขาย", each ([กำหนดเอง] = "คำนวณค่าคอม")),
    ผสานข้อคำถาม1 = Table.NestedJoin(กรองแถวแล้ว1, {"วันที่ลงเวลา", "ข้อมูลพนักงานขาย.รหัสสาขา"}, A_รายงานการขายรถจักรยานยนต์_EX, {"วันที่ขาย", "สาขา"}, "A_รายงานการขายรถจักรยานยนต์_EX", JoinKind.LeftOuter),
    #"ขยาย A_รายงานการขายรถจักรยานยนต์_EX" = Table.ExpandTableColumn(ผสานข้อคำถาม1, "A_รายงานการขายรถจักรยานยนต์_EX", {"เลขที่ใบขาย", "ประเภทใบขาย"}, {"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย", "A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย"}),
    เรียงลำดับแถวแล้ว = Table.Sort(#"ขยาย A_รายงานการขายรถจักรยานยนต์_EX",{{"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย", Order.Ascending}}),
    ทำซ้ำคอลัมน์แล้ว = Table.DuplicateColumn(เรียงลำดับแถวแล้ว, "วันที่ลงเวลา", "เวลาเข้างาน - คัดลอก"),
    ทำซ้ำคอลัมน์แล้ว1 = Table.DuplicateColumn(ทำซ้ำคอลัมน์แล้ว, "เวลาเข้างาน - คัดลอก", "เวลาเข้างาน - คัดลอก - คัดลอก"),
    ปีที่แยกออก = Table.TransformColumns(ทำซ้ำคอลัมน์แล้ว1,{{"เวลาเข้างาน - คัดลอก", Date.Year, Int64.Type}}),
    เดิอนที่แยกออก = Table.TransformColumns(ปีที่แยกออก,{{"เวลาเข้างาน - คัดลอก - คัดลอก", Date.Month, Int64.Type}}),
    ผสานคอลัมน์แล้ว = Table.CombineColumns(Table.TransformColumnTypes(เดิอนที่แยกออก, {{"เวลาเข้างาน - คัดลอก", type text}, {"เวลาเข้างาน - คัดลอก - คัดลอก", type text}}, "th-TH"),{"เวลาเข้างาน - คัดลอก", "เวลาเข้างาน - คัดลอก - คัดลอก"},Combiner.CombineTextByDelimiter("-", QuoteStyle.None),"ผสานรวมกันแล้ว"),
    ผสานข้อคำถาม2 = Table.NestedJoin(ผสานคอลัมน์แล้ว, {"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย"}, #"จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย", {"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย"}, "จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย", JoinKind.LeftOuter),
    #"ขยาย จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย" = Table.ExpandTableColumn(ผสานข้อคำถาม2, "จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย", {"จำนวน"}, {"จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย.จำนวน"}),
    กรองแถวแล้ว4 = Table.SelectRows(#"ขยาย จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย", each ([#"จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย.จำนวน"] <> null)),
    จัดกลุ่มแถวแล้ว = Table.Group(กรองแถวแล้ว4, {"Employee Name", "ผสานรวมกันแล้ว"}, {{"all", each _, type table [Source.Name=nullable date, Employee Name=nullable text, Team Name=nullable text, เวลาเข้างาน=nullable date, #"ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ"=nullable text, #"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ"=nullable text, สังกัด=nullable text, สรุปประเภทวันหยุด=nullable text, สรุปวันทำงาน=nullable text, กำหนดเอง=text, ข้อมูลพนักงานขาย.รหัสสาขา=nullable text, ข้อมูลพนักงานขาย.สาขา=nullable text, A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย=nullable text, A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย=nullable text, ผสานรวมกันแล้ว=text]}}),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว1 = Table.AddColumn(จัดกลุ่มแถวแล้ว, "กำหนดเอง", each Table.AddIndexColumn([all],"index",1,1)),
    เอาคอลัมน์อื่นออกแล้ว = Table.SelectColumns(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว1,{"กำหนดเอง"}),
    #"ขยาย กำหนดเอง" = Table.ExpandTableColumn(เอาคอลัมน์อื่นออกแล้ว, "กำหนดเอง", {"วันที่ลงเวลา", "Employee Name", "ประจำเดือน", "Team Name", "สังกัด", "ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ", "ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ", "สรุปประเภทวันหยุด", "สรุปวันทำงาน", "กำหนดเอง", "ข้อมูลพนักงานขาย.รหัสสาขา", "ข้อมูลพนักงานขาย.สาขา", "A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย", "A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย", "ผสานรวมกันแล้ว", "จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย.จำนวน", "index"}, {"วันที่ลงเวลา", "Employee Name", "ประจำเดือน", "Team Name", "สังกัด", "ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ", "ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ", "สรุปประเภทวันหยุด", "สรุปวันทำงาน", "กำหนดเอง.1", "ข้อมูลพนักงานขาย.รหัสสาขา", "ข้อมูลพนักงานขาย.สาขา", "A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย", "A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย", "ผสานรวมกันแล้ว", "จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย.จำนวน", "index"}),
    ผสานข้อคำถาม3 = Table.NestedJoin(#"ขยาย กำหนดเอง", {"ข้อมูลพนักงานขาย.รหัสสาขา", "ผสานรวมกันแล้ว"}, เป็าสิงห์ชัย, {"ร้าน", "เดือน"}, "เป็าสิงห์ชัย", JoinKind.LeftOuter),
    #"ขยาย เป็าสิงห์ชัย" = Table.ExpandTableColumn(ผสานข้อคำถาม3, "เป็าสิงห์ชัย", {"เป้า"}, {"เป็าสิงห์ชัย.เป้า"}),
    คอลัมน์เงื่อนไขที่เพิ่ม3 = Table.AddColumn(#"ขยาย เป็าสิงห์ชัย", "เป้า", each if [เป็าสิงห์ชัย.เป้า] <> null then [เป็าสิงห์ชัย.เป้า] else 100),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว2 = Table.AddColumn(คอลัมน์เงื่อนไขที่เพิ่ม3, "กำหนดเอง", each if [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY01" then 
    if [A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย] = "ขายปลีก" then 0 else
    if [index] > [เป้า] then 300 else 100
else 0),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว3 = Table.AddColumn(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว2, "กำหนดเอง.2", each if[ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY04" or [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY07" then 
   if [index] > 50 then 
      if [A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย] = "ขายปลีก" then 0
      else 300
   else
      if [A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย]= "ขายปลีก" then 0
      else 300/[#"จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย.จำนวน"]
else 0),
    เปลี่ยนชื่อคอลัมน์แล้ว = Table.RenameColumns(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว3,{{"กำหนดเอง", "ค่าคอม SCY01"}, {"กำหนดเอง.2", "ค่าคอม SCY04-07"}}),
    คอลัมน์เงื่อนไขที่เพิ่ม = Table.AddColumn(เปลี่ยนชื่อคอลัมน์แล้ว, "กำหนดเอง.3", each if [ค่าคอม SCY01] <> 0 then [ค่าคอม SCY01] else if [#"ค่าคอม SCY04-07"] <> 0 then [#"ค่าคอม SCY04-07"] else 0),
    เปลี่ยนชื่อคอลัมน์แล้ว1 = Table.RenameColumns(คอลัมน์เงื่อนไขที่เพิ่ม,{{"กำหนดเอง.3", "ค่าคอม-สิงห์ชัย"}}),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว4 = Table.AddColumn(เปลี่ยนชื่อคอลัมน์แล้ว1, "ค่าคอม SCY06", each if [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY06" or [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY05" then
if [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY06" then
     if [index] <= 40 then 0 
    else 300+Number.IntegerDivide([index]-41,10)*10
    else 
    if [index] <= 20 then 0 
    else 300+Number.IntegerDivide([index]-41,10)*10
else 0),
    เปลี่ยนชื่อคอลัมน์แล้ว2 = Table.RenameColumns(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว4,{{"ค่าคอม SCY06", "ค่าคอม SCY05-06"}}),
    คอลัมน์เงื่อนไขที่เพิ่ม1 = Table.AddColumn(เปลี่ยนชื่อคอลัมน์แล้ว2, "กำหนดเอง", each if [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY05" then 300 else if [ข้อมูลพนักงานขาย.รหัสสาขา] = "SCY06" then 300 else 0),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว5 = Table.AddColumn(คอลัมน์เงื่อนไขที่เพิ่ม1, "กำหนดเอง.2", each [กำหนดเอง]/[#"จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย.จำนวน"]),
    คอลัมน์เงื่อนไขที่เพิ่ม2 = Table.AddColumn(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว5, "กำหนดเอง.3", each if [A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย] = "ขายไฟแนนซ์" then [กำหนดเอง.2] else 0),
    เอาคอลัมน์ออกแล้ว1 = Table.RemoveColumns(คอลัมน์เงื่อนไขที่เพิ่ม2,{"กำหนดเอง", "กำหนดเอง.2"}),
    เปลี่ยนชื่อคอลัมน์แล้ว3 = Table.RenameColumns(เอาคอลัมน์ออกแล้ว1,{{"กำหนดเอง.3", "ค่าคอม2 SCY05-06"}}),
    แทนที่ค่าแล้ว = Table.ReplaceValue(เปลี่ยนชื่อคอลัมน์แล้ว3,null,0,Replacer.ReplaceValue,{"ค่าคอม2 SCY05-06"}),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว6 = Table.AddColumn(แทนที่ค่าแล้ว, "ค่าคอมสุทธิ", each [#"ค่าคอม-สิงห์ชัย"]+[#"ค่าคอม SCY05-06"]+[#"ค่าคอม2 SCY05-06"])
in
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว6;

shared #"จัดกลุ่ม-รถที่ขาย-ตามพนักงานขาย" = let
    แหล่งที่มา = Excel.Workbook(File.Contents("C:\Users\manat\OneDrive\ระบบเงินเดือน\รายงานาเงินเดือนV2.xlsx"), null, true),
    คำนวณเวลาทำงาน__2_Table = แหล่งที่มา{[Item="คำนวณเวลาทำงาน__2",Kind="Table"]}[Data],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(คำนวณเวลาทำงาน__2_Table,{{"วันที่ลงเวลา", type date}, {"Employee Name", type text}, {"ประจำเดือน", type date}, {"เดือน-ข้อมูลพนักงาน", type date}, {"Team Name", type text}, {"Position Name", type text}, {"Day", type text}, {"Clock In", type text}, {"In Type", type text}, {"In Name", type text}, {"Clock Out", type text}, {"Out Type", type text}, {"Out Name", type text}, {"Sum", type text}, {"Actual Time", type text}, {"Work Hour", type text}, {"Clock Late", type text}, {"Leave Early", type text}, {"Over Time", type text}, {"ประเภทวันลา", type text}, {"เวลาที่ขอลา", type text}, {"Leave Time", type text}, {"Absence", type text}, {"Break Duration", type text}, {"ข้อมูลพนักงาน (2).Team name", type text}, {"รหัสร้าน", type text}, {"ตำแหน่ง", type text}, {"สังกัด", type text}, {"วันนหยุด", type text}, {"ข้อมูลพนักงาน (2).วันหยุดกลางเดือน", type text}, {"ข้อมูลพนักงาน (2).ค่าซักเสื้อ", Int64.Type}, {"ข้อมูลพนักงาน (2).ค่าข้าว", type any}, {"ข้อมูลพนักงาน (2).ค่าเบี้ยขยัน", Int64.Type}, {"ข้อมูลพนักงาน (2).ประกันสังคม", type number}, {"ข้อมูลพนักงาน (2).กองทุนสำรองฯ", type number}, {"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ", type text}, {"ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ", type text}, {"ข้อมูลพนักงาน (2).สถานะการทำงาน", type any}, {"ข้อมูลพนักงาน (2).เลขที่บัญชี", type text}, {"ข้อมูลพนักงาน (2).คอลัมน์3", type text}, {"ข้อมูลพนักงาน (2). เงินเดือน/ครั้ง ", type number}, {"ข้อมูลพนักงาน (2).เงินเพิ่มพิเศษ", Int64.Type}, {"ข้อมูลพนักงาน (2).OT-วันทำงาน", type number}, {"ข้อมูลพนักงาน (2).ก.ย.ศ", Int64.Type}, {"วันหยุดกลางเดือน", type text}, {"วันหยุดประจำปี.KEY", type text}, {"วันหยุดชดเชย-กลางเดือน.ชดเชยวันหยุดประจำปี", type text}, {"สลับวันหยุด.ประเภทวันหยุด", type any}, {"วันหยุดประจำสัปดาห์1", type text}, {"วันหยุดกลางเดือน1", type text}, {"ไม่สแเกนเวลาเข้างาน", type any}, {"สรุปประเภทวันหยุด", type text}, {"สรุปวันทำงาน", type text}, {"ค่าข้าว", type any}, {"ค่าซักเสื้อ", Int64.Type}, {"ค่าเบี้ยขยัน", Int64.Type}, {"เวลาการมาทำงาน", type text}}),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว = Table.AddColumn(เปลี่ยนแปลงชนิดแล้ว, "กำหนดเอง", each let
    สังกัด = [สังกัด],
    ประเภทวันหยุด = [สรุปประเภทวันหยุด],
    สถานะวันทำงาน = [สรุปวันทำงาน],
    วันหยุดไม่มีค่าคอม_สิงห์ชัย = {"ลากิจ", "ลาป่วย", "ลาพักร้อน", "ขาดงาน","ลาคลอดบุตร", "วันหยุดประจำปี"},
    วันหยุดไม่มีค่าคอม_ทั่วไป = {"ลากิจ", "ลาป่วย", "ลาพักร้อน", "ขาดงาน","ลาคลอดบุตร","วันหยุดกลางดือน"}
in
    if สังกัด = "สิงห์ชัย" then
        if List.Contains(วันหยุดไม่มีค่าคอม_สิงห์ชัย, ประเภทวันหยุด) then 
        if [สรุปประเภทวันหยุด] = "วันหยุดประจำปี" and [สรุปวันทำงาน] = "วันทำงาน" then "คำนวณค่าคอม" else 
         null
        else
            "คำนวณค่าคอม"
    else
        if List.Contains(วันหยุดไม่มีค่าคอม_ทั่วไป, ประเภทวันหยุด) then
            null
        else
            if [สรุปวันทำงาน] = "วันทำงาน" then "คำนวณค่าคอม" else null),
    ผสานข้อคำถาม = Table.NestedJoin(มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว, {"Employee Name"}, ข้อมูลพนักงานขาย, {"Employee Name"}, "ข้อมูลพนักงานขาย", JoinKind.LeftOuter),
    #"ขยาย ข้อมูลพนักงานขาย" = Table.ExpandTableColumn(ผสานข้อคำถาม, "ข้อมูลพนักงานขาย", {"รหัสสาขา", "สาขา"}, {"ข้อมูลพนักงานขาย.รหัสสาขา", "ข้อมูลพนักงานขาย.สาขา"}),
    กรองแถวแล้ว = Table.SelectRows(#"ขยาย ข้อมูลพนักงานขาย", each ([กำหนดเอง] = "คำนวณค่าคอม")),
    ผสานข้อคำถาม1 = Table.NestedJoin(กรองแถวแล้ว, {"วันที่ลงเวลา", "ข้อมูลพนักงานขาย.รหัสสาขา"}, A_รายงานการขายรถจักรยานยนต์_EX, {"วันที่ขาย", "สาขา"}, "A_รายงานการขายรถจักรยานยนต์_EX", JoinKind.LeftOuter),
    #"ขยาย A_รายงานการขายรถจักรยานยนต์_EX" = Table.ExpandTableColumn(ผสานข้อคำถาม1, "A_รายงานการขายรถจักรยานยนต์_EX", {"เลขที่ใบขาย", "ประเภทใบขาย"}, {"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย", "A_รายงานการขายรถจักรยานยนต์_EX.ประเภทใบขาย"}),
    กรองแถวแล้ว2 = Table.SelectRows(#"ขยาย A_รายงานการขายรถจักรยานยนต์_EX", each [A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย] <> null),
    เรียงลำดับแถวแล้ว = Table.Sort(กรองแถวแล้ว2,{{"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย", Order.Ascending}}),
    จัดกลุ่มแถวแล้ว = Table.Group(เรียงลำดับแถวแล้ว, {"A_รายงานการขายรถจักรยานยนต์_EX.เลขที่ใบขาย"}, {{"จำนวน", each Table.RowCount(_), Int64.Type}})
in
    จัดกลุ่มแถวแล้ว;

shared วันทำงานทั้งหมด = let
    แหล่งที่มา = Excel.Workbook(File.Contents("C:\Users\manat\OneDrive\ระบบเงินเดือน\รายงานาเงินเดือนV2.xlsx"), null, true),
    คำนวณเวลาทำงาน__2_Table = แหล่งที่มา{[Item="คำนวณเวลาทำงาน__2",Kind="Table"]}[Data],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(คำนวณเวลาทำงาน__2_Table,{{"วันที่ลงเวลา", type date}, {"Employee Name", type text}, {"ประจำเดือน", type date}, {"เดือน-ข้อมูลพนักงาน", type date}, {"Team Name", type text}, {"Position Name", type text}, {"Day", type text}, {"Clock In", type text}, {"In Type", type text}, {"In Name", type text}, {"Clock Out", type text}, {"Out Type", type text}, {"Out Name", type text}, {"Sum", type text}, {"Actual Time", type text}, {"Work Hour", type text}, {"Clock Late", type text}, {"Leave Early", type text}, {"Over Time", type text}, {"ประเภทวันลา", type text}, {"เวลาที่ขอลา", type text}, {"Leave Time", type text}, {"Absence", type text}, {"Break Duration", type text}, {"ข้อมูลพนักงาน (2).Team name", type text}, {"รหัสร้าน", type text}, {"ตำแหน่ง", type text}, {"สังกัด", type text}, {"วันนหยุด", type text}, {"ข้อมูลพนักงาน (2).วันหยุดกลางเดือน", type text}, {"ข้อมูลพนักงาน (2).ค่าซักเสื้อ", Int64.Type}, {"ข้อมูลพนักงาน (2).ค่าข้าว", type any}, {"ข้อมูลพนักงาน (2).ค่าเบี้ยขยัน", Int64.Type}, {"ข้อมูลพนักงาน (2).ประกันสังคม", type number}, {"ข้อมูลพนักงาน (2).กองทุนสำรองฯ", type number}, {"ข้อมูลพนักงาน (2).คำนวนค่าคอมปกติ", type text}, {"ข้อมูลพนักงาน (2).คำนวณค่าคอมพิเศษ", type text}, {"ข้อมูลพนักงาน (2).สถานะการทำงาน", type any}, {"ข้อมูลพนักงาน (2).เลขที่บัญชี", type text}, {"ข้อมูลพนักงาน (2).คอลัมน์3", type text}, {"ข้อมูลพนักงาน (2). เงินเดือน/ครั้ง ", type number}, {"ข้อมูลพนักงาน (2).เงินเพิ่มพิเศษ", Int64.Type}, {"ข้อมูลพนักงาน (2).OT-วันทำงาน", type number}, {"ข้อมูลพนักงาน (2).ก.ย.ศ", Int64.Type}, {"วันหยุดกลางเดือน", type text}, {"วันหยุดประจำปี.KEY", type text}, {"วันหยุดชดเชย-กลางเดือน.ชดเชยวันหยุดประจำปี", type text}, {"สลับวันหยุด.ประเภทวันหยุด", type any}, {"วันหยุดประจำสัปดาห์1", type text}, {"วันหยุดกลางเดือน1", type text}, {"ไม่สแเกนเวลาเข้างาน", type any}, {"สรุปประเภทวันหยุด", type text}, {"สรุปวันทำงาน", type text}, {"ค่าข้าว", type any}, {"ค่าซักเสื้อ", Int64.Type}, {"ค่าเบี้ยขยัน", Int64.Type}, {"เวลาการมาทำงาน", type text}}),
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว = Table.AddColumn(เปลี่ยนแปลงชนิดแล้ว, "กำหนดเอง", each if [สังกัด] = "สิงห์ชัย" then 
   if [สรุปประเภทวันหยุด] = "ลากิจ" or [สรุปประเภทวันหยุด] = "ลาป่วย" or [สรุปประเภทวันหยุด] = "ลาพักร้อน" or[สรุปประเภทวันหยุด] = "ขาดงาน" or [สรุปประเภทวันหยุด] ="วันหยุดประจำปี" or [สรุปประเภทวันหยุด] = "ชดเชย"
   then null else "คำนวณค่าคอม"
else if [สรุปวันทำงาน] = "วันหยด" then null else "คำนวณค่าคอม")
in
    มีการเพิ่มคอลัมน์แบบกำหนดเองแล้ว;

shared ตารางราคาลาสุด1 = let
    แหล่งที่มา = Excel.Workbook(File.Contents("C:\Users\manat\OneDrive\ระบบงาน\ระบบงาน 2\ตารางราคารถจักรยานยนต์\ตารางราคารถจักรยายนต์.xlsx"), null, true),
    ตารางราคาลาสุด_Table = แหล่งที่มา{[Item="ตารางราคาลาสุด",Kind="Table"]}[Data],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(ตารางราคาลาสุด_Table,{{"ยี่ห้อ", type text}, {"รุ่น", type text}, {"แบบ", type text}, {"วันที่ล่าสุด", type date}, {"ตารางราคา.ราคาขายเงินสด", Int64.Type}, {"ตารางราคา.ราคาขายเงินสด 2", Int64.Type}, {"ตารางราคา.ราคาไฟแนนท์ 1", Int64.Type}, {"ตารางราคา.ราคาไฟแนนท์ 2", Int64.Type}, {"ตารางราคา.สถานะการผลิต", type text}})
in
    เปลี่ยนแปลงชนิดแล้ว;

shared เป็าสิงห์ชัย = let
    แหล่งที่มา = Excel.CurrentWorkbook(){[Name="Table1"]}[Content],
    เปลี่ยนแปลงชนิดแล้ว = Table.TransformColumnTypes(แหล่งที่มา,{{"เดือน", type text}, {"เป้า", Int64.Type}, {"ร้าน", type text}})
in
    เปลี่ยนแปลงชนิดแล้ว;